Revit 2027 API
BuiltInFailures.GroupFailures.GroupedModelElemHasViewSpecificSubordinates Property
 Unable to group the selected elements. Model element in group has view specific subordinates or view specific element in group has non-view specific subordinates.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId GroupedModelElemHasViewSpecificSubordinates { get; }
Public Shared ReadOnly Property GroupedModelElemHasViewSpecificSubordinates As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ GroupedModelElemHasViewSpecificSubordinates {
	FailureDefinitionId^ get ();
}
static member GroupedModelElemHasViewSpecificSubordinates : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.GroupFailures Class
Autodesk.Revit.DB Namespace